NSCameraUsageDescription = "دسترسی به دوربین برای اسکن مدارک و گرفتن عکس و ویدیو الزامی است.";
NSFaceIDUsageDescription = "دسترسی به Face ID برای احراز هویت با تشخیص چهره الزامی است.";
NSLocationAlwaysUsageDescription = "برنامه از موقعیت مکانی شما برای شروع خودکار آپلود فایل‌ها هنگام جابه‌جایی بین مناطق استفاده می‌کند.";
NSPhotoLibraryUsageDescription = "دسترسی به کتابخانه تصاویر برای آپلود عکس‌ها و ویدیوهای شما به فضای ابری الزامی است.";
NSPhotoLibraryAddUsageDescription = "دسترسی به کتابخانه تصاویر برای آپلود عکس‌ها و ویدیوهای شما به فضای ابری الزامی است.";
NSMicrophoneUsageDescription = "دسترسی به میکروفون برای ایجاد یادداشت‌های صوتی الزامی است.";
NSLocationWhenInUseUsageDescription = "این برنامه از موقعیت مکانی شما برای تشخیص جابه‌جایی و آپلود خودکار فایل‌ها استفاده می‌کند. این قابلیت از GPS استفاده نکرده و موقعیت شما را ذخیره نمی‌کند.";
NSLocationAlwaysAndWhenInUseUsageDescription = "این برنامه حتی در پس‌زمینه به دسترسی موقعیت مکانی نیاز دارد تا هنگام تشخیص جابه‌جایی عمده، آپلود فایل‌ها را به‌صورت خودکار آغاز کند. از GPS استفاده نمی‌شود.";
